/*******************************************************************************************
*          版权所属, C ,2018- ,成都传奇兄弟信息技术有限公司
*
*作者:嵌入式开发部              日期:2018-11-6            版本:V0.0
*说明:
*    对芯片内部flash操作。
*    操作时传入的地址时相对地址
*修改:
*    2018-11-5:增加固件升级功能。
*******************************************************************************************/

#ifndef APP_FLASH_MEMORY_FDS_H_
#define APP_FLASH_MEMORY_FDS_H_


#include <stdbool.h>
#include <stdint.h>
#include "fds.h"
#include "fstorage.h"

#define FLASH_DEBUG

/**********************************************************************
函数名:Flash_Init
功能:初始化Flash
输入参数:None
输出参数:None
返回值:None
说明:
***********************************************************************/
void Flash_Init(void);

/**********************************************************************
函数名:Flash_Read
功能:从指定地址读取，指定长度的数据
输入参数:
@start_addr:开始读取的地址(相对地址,以0开始)
@len:需要读取的长度(以字位单位)
输出参数:
@pData:读取的数据返回
返回值:fs_ret_t
说明:
Flash读取数据，都是以字读(32位)
***********************************************************************/
fs_ret_t Flash_Read(const uint32_t start_addr, uint32_t *pData, const uint16_t len);

/**********************************************************************
函数名:Flash_Erase_Page
功能:从指定的页数开始，连续擦除页
输入参数:
@start_page:开始的页
@number:需要擦出的页数
输出参数:None
返回值:fs_ret_t
说明:
***********************************************************************/
fs_ret_t Flash_Erase_Page(const uint8_t start_page, const uint8_t number );

/**********************************************************************
函数名:Flash_Write
功能:向指定地址连续写数据
输入参数:
@start_addr:写入的开始地址(相对地址,以0开始)
@p_data:需要写入的数据(以字位单位)
@len:需要写入的数据的长度(以字位单位)
输出参数:None
返回值:fs_ret_t
说明:
***********************************************************************/
fs_ret_t Flash_Write(const uint32_t start_addr, const uint32_t *p_data, const uint16_t len );


#endif
