/***************************************************************************
 版权 (c), 2018- ,成都传奇兄弟信息技术有限公司

作者:硬件部
版本:V0.0
日期:2018-10-11
描述:
    用于从心率/血压传感器中读取心率值,血压值
***************************************************************************/
#ifndef __HEAT_SENSOR_H__
#define __HEAT_SENSOR_H__

#include "boards.h"
#include "timer.h"
#include "app_timer.h"

/* 发送命令枚举 */
typedef enum{
    SENSOR_ADJUST = 0,         //传感器校准
    SENSOR_READ,               //读取血压心率
    SENSOR_ECG,                //读取心电数据
    SENSOR_MAX,
}Send_Cmd_type_e;

/*************************************************************************
函数名:Open_Heat_Sensor
功能:打开心率血压传感器采集
输入参数:
@ms:采集间隔
@mode:定时器运行模式
APP_TIMER_MODE_SINGLE_SHOT     //单次
APP_TIMER_MODE_REPEATED        //循环
输出参数:None
返回值:None
*************************************************************************/
void Open_Heat_Sensor(uint32_t ms,app_timer_mode_t mode);

/*************************************************************************
函数名:Close_Heat_Sensor
功能:关闭心率血压传感器采集
输入参数:None
输出参数:None
返回值:None
*************************************************************************/
void Close_Heat_Sensor(void);

/*************************************************************************
函数名:Heat_sensor_Init
功能:初始化心率血压传感器采集
输入参数:None
输出参数:None
返回值:None
描述:初始化采集传感器，是创建采集定时器
*************************************************************************/
void Heat_sensor_Init(void);

/*************************************************************************
函数名:Sensor_Adjust
功能:校准传感器
输入参数:
@sysstolic:收缩压
@diastole:舒张压
@heart:心率
输出参数:None
返回值:None
说明:
    校准传感器，3S发送一次命令
*************************************************************************/
void Sensor_Adjust(const uint8_t sysstolic, const uint8_t diastole, const uint8_t heart );

/*************************************************************************
函数名:Sensor_ReadData
功能:读取心率血压值
输入参数:None
输出参数:None
返回值:None
说明：
    读取数据，1S读一次
*************************************************************************/
void Sensor_ReadData(void);

/*************************************************************************
函数名:Sensor_ReadECG
功能:读取心电数据
输入参数:
@EN:打开采集或关闭采集
输出参数:None
返回值:None
说明：
    读取心电数据，10mS读一次
    ECG值需要连续采集，所以需要设置开始和结束
*************************************************************************/
void Sensor_ReadECG(Enable_e EN);


#endif
